Millisman/OCPP-NANO/mock/mcu/mcu_iom644pa.h
/* EEPROM Address Register */
#  ifndef EEAR
#    define EEAR   _SFR_IO16(0x1E)
#  endif
#  ifndef EEARL
#    define EEARL  (0x1E)
#  endif
#  ifndef EEARH
#    define EEARH  (0x1F)
#  endif

/* EEPROM Control Register bits */
#  ifndef EERE
#    define EERE   (0)
#  endif
#  ifndef EEWE
#    define EEWE   (1)
#  endif
#  ifndef EEMWE
#    define EEMWE  (2)
#  endif
#  ifndef EERIE
#    define EERIE  (3)
#  endif


/* RAM Page Z Select Register	*/
#ifndef RAMPZ
#  if     defined(__AVR_HAVE_RAMPZ__) && __AVR_HAVE_RAMPZ__
#    if     __AVR_ARCH__ >= 100
#      define RAMPZ	(0x3B)
#    else
#      define RAMPZ	(0x3B)
#    endif
#  endif
#endif



/*------------ Common Symbols ------------*/

/* 
 * Generic definitions for registers that are common across multiple AVR devices
 * and families.
 */

/* Pointer registers definitions */
#if __AVR_ARCH__ != 1  /* avr1 does not have X and Y pointers */
#  define XL  r26
#  define XH  r27
#  define YL  r28
#  define YH  r29
#endif /* #if __AVR_ARCH__ != 1 */
#define ZL  r30
#define ZH  r31


/* Status Register */
#if defined(SREG)
#  define AVR_STATUS_REG   SREG
#  if __AVR_ARCH__ >= 100
#    define AVR_STATUS_ADDR  _SFR_MEM_ADDR(SREG)
#  else
#    define AVR_STATUS_ADDR  _SFR_IO_ADDR(SREG)
#  endif
#endif

/* Stack Pointer (combined) Register */
#if defined(SP)
#  define AVR_STACK_POINTER_REG   SP
#  if __AVR_ARCH__ >= 100
#    define AVR_STACK_POINTER_ADDR  _SFR_MEM_ADDR(SP)
#  else
#    define AVR_STACK_POINTER_ADDR  _SFR_IO_ADDR(SP)
#  endif
#endif

/* Stack Pointer High Register */
#if defined(SPH)
#  define _HAVE_AVR_STACK_POINTER_HI 1
#  define AVR_STACK_POINTER_HI_REG   SPH
#  if __AVR_ARCH__ >= 100
#    define AVR_STACK_POINTER_HI_ADDR  _SFR_MEM_ADDR(SPH)
#  else
#    define AVR_STACK_POINTER_HI_ADDR  _SFR_IO_ADDR(SPH)
#  endif
#endif

/* Stack Pointer Low Register */
#if defined(SPL)
#  define AVR_STACK_POINTER_LO_REG   SPL
#  if __AVR_ARCH__ >= 100
#    define AVR_STACK_POINTER_LO_ADDR  _SFR_MEM_ADDR(SPL)
#  else
#    define AVR_STACK_POINTER_LO_ADDR  _SFR_IO_ADDR(SPL)
#  endif
#endif

/* RAMPD Register */
#if defined(RAMPD)
#  define AVR_RAMPD_REG   RAMPD
#  if __AVR_ARCH__ >= 100
#    define AVR_RAMPD_ADDR  _SFR_MEM_ADDR(RAMPD)
#  else
#    define AVR_RAMPD_ADDR  _SFR_IO_ADDR(RAMPD)
#  endif
#endif

/* RAMPX Register */
#if defined(RAMPX)
#  define AVR_RAMPX_REG   RAMPX
#  if __AVR_ARCH__ >= 100
#    define AVR_RAMPX_ADDR  _SFR_MEM_ADDR(RAMPX)
#  else
#    define AVR_RAMPX_ADDR  _SFR_IO_ADDR(RAMPX)
#  endif
#endif

/* RAMPY Register */
#if defined(RAMPY)
#  define AVR_RAMPY_REG   RAMPY
#  if __AVR_ARCH__ >= 100
#    define AVR_RAMPY_ADDR  _SFR_MEM_ADDR(RAMPY)
#  else
#    define AVR_RAMPY_ADDR  _SFR_IO_ADDR(RAMPY)
#  endif
#endif

/* RAMPZ Register */
#if defined(RAMPZ)
#  define AVR_RAMPZ_REG   RAMPZ
#  if __AVR_ARCH__ >= 100
#    define AVR_RAMPZ_ADDR  _SFR_MEM_ADDR(RAMPZ)
#  else
#    define AVR_RAMPZ_ADDR  _SFR_IO_ADDR(RAMPZ)
#  endif
#endif

/* Extended Indirect Register */
#if defined(EIND)
#  define AVR_EXTENDED_INDIRECT_REG   EIND
#  if __AVR_ARCH__ >= 100
#    define AVR_EXTENDED_INDIRECT_ADDR  _SFR_MEM_ADDR(EIND)
#  else
#    define AVR_EXTENDED_INDIRECT_ADDR  _SFR_IO_ADDR(EIND)
#  endif
#endif

/*------------ Workaround to old compilers (4.1.2 and earlier)  ------------*/

#ifndef __AVR_HAVE_MOVW__
# if  defined(__AVR_ENHANCED__) && __AVR_ENHANCED__
#  define __AVR_HAVE_MOVW__ 1
# endif
#endif

#ifndef __AVR_HAVE_LPMX__
# if  defined(__AVR_ENHANCED__) && __AVR_ENHANCED__
#  define __AVR_HAVE_LPMX__ 1
# endif
#endif

#ifndef __AVR_HAVE_MUL__
# if  defined(__AVR_ENHANCED__) && __AVR_ENHANCED__
#  define __AVR_HAVE_MUL__ 1
# endif
#endif

#define __AVR_LIBC_VERSION_STRING__ "2.0.0"

/** \ingroup avr_version
 *    Numerical representation of the current library version.
 * 
 *    In the numerical representation, the major number is multiplied by
 *    10000, the minor number by 100, and all three parts are then
 *    added.  It is intented to provide a monotonically increasing
 *    numerical value that can easily be used in numerical checks.
 */
#define __AVR_LIBC_VERSION__        20000UL

/** \ingroup avr_version
 *    String literal representation of the release date. */
#define __AVR_LIBC_DATE_STRING__    "20150208"

/** \ingroup avr_version
 *    Numerical representation of the release date. */
#define __AVR_LIBC_DATE_            20150208UL

/** \ingroup avr_version
 *    Library major version number. */
#define __AVR_LIBC_MAJOR__          2

/** \ingroup avr_version
 *    Library minor version number. */
#define __AVR_LIBC_MINOR__          0

/** \ingroup avr_version
 *    Library revision number. */
#define __AVR_LIBC_REVISION__       0



#define _AVR_FUSE_H_ 1


#ifndef FUSEMEM
#define FUSEMEM  __attribute__((__used__, __section__ (".fuse")))
#endif

#if FUSE_MEMORY_SIZE > 3

typedef struct
{
    unsigned char byte[FUSE_MEMORY_SIZE];
} __fuse_t;


#elif FUSE_MEMORY_SIZE == 3

typedef struct
{
    unsigned char low;
    unsigned char high;
    unsigned char extended;
} __fuse_t;

#elif FUSE_MEMORY_SIZE == 2

typedef struct
{
    unsigned char low;
    unsigned char high;
} __fuse_t;

#elif FUSE_MEMORY_SIZE == 1

typedef struct
{
    unsigned char byte;
} __fuse_t;

#endif

#if !defined(FUSES)
#if defined(__AVR_XMEGA__)
#define FUSES NVM_FUSES_t __fuse FUSEMEM
#else
#define FUSES __fuse_t __fuse FUSEMEM
#endif
#endif




#ifndef LOCKMEM
#define LOCKMEM  __attribute__((__used__, __section__ (".lock")))
#endif

#ifndef LOCKBITS
#define LOCKBITS unsigned char __lock LOCKMEM
#endif

/* Lock Bit Modes */
#if defined(__LOCK_BITS_EXIST)
#define LB_MODE_1  (0xFF)
#define LB_MODE_2  (0xFE)
#define LB_MODE_3  (0xFC)
#endif

#if defined(__BOOT_LOCK_BITS_0_EXIST)
#define BLB0_MODE_1  (0xFF)
#define BLB0_MODE_2  (0xFB)
#define BLB0_MODE_3  (0xF3)
#define BLB0_MODE_4  (0xF7)
#endif

#if defined(__BOOT_LOCK_BITS_1_EXIST)
#define BLB1_MODE_1  (0xFF)
#define BLB1_MODE_2  (0xEF)
#define BLB1_MODE_3  (0xCF)
#define BLB1_MODE_4  (0xDF)
#endif

#if defined(__BOOT_LOCK_APPLICATION_TABLE_BITS_EXIST)
#define BLBAT0 ~_BV(2)
#define BLBAT1 ~_BV(3)
#endif

#if defined(__BOOT_LOCK_APPLICATION_BITS_EXIST)
#define BLBA0 ~_BV(4)
#define BLBA1 ~_BV(5)
#endif

#if defined(__BOOT_LOCK_BOOT_BITS_EXIST)
#define BLBB0 ~_BV(6)
#define BLBB1 ~_BV(7)
#endif


#define LOCKBITS_DEFAULT (0xFF)
